<?php
/* ----------------------------------------------- *
 | [ AdminPHP ] Version : 2.0 beta
 | 简单粗暴又不失高雅的迫真 OOP MVC 框架，，，
 |
 | URL     : https://www.adminphp.net/
 * ----------------------------------------------- *
 | Name    : 多语言:繁体中文
 |
 | Author  : Xlch88 (i@xlch.me)
 | LICENSE : WTFPL http://www.wtfpl.net/about
 * ----------------------------------------------- */

return [
	'无法自动加载类。'					=> '無法自動加載類。',
	'已加载类文件，但未成功加载类。'	=> '已加載類文件，但未成功加載類。',
	'连接数据库失败！'					=> '連接數據庫失敗！',
	'执行SQL查询语句时出现错误。'		=> '執行SQL查詢語句時出現錯誤。',
	'arr2sql转换错误: 值应该是文本型/整数型/布尔型，却传入了数组或其他类型。'	=> 'arr2sql轉換錯誤: 值應該是文本型/整數型/布爾型，卻傳入了數組或其他類型。',
	'arr2sql转换错误: 值应该是数组型，却传入了文本型/整数型/布尔型或其他类型。'	=> 'arr2sql轉換錯誤: 值應該是數組型，卻傳入了文本型/整數型/布爾型或其他類型。',
	'路由规则内有未闭合括号！'			=> '路由規則內有未閉合括號！',
	'路由解析失败。'					=> '路由解析失敗。',
	'未找到正则表达式。'				=> '未找到正則表達式。',
	'模板文件未找到！'					=> '模板文件未找到！',
	'应用目录不存在！'					=> '應用目錄不存在！',
	'模板目录不存在！'					=> '模板目錄不存在！',
	'配置文件目录不存在！'				=> '設定檔目錄不存在！',
	'配置文件不存在！'					=> '設定檔不存在！',
	'配置文件未能通过类型验证！'		=> '設定檔未能通過類型驗證！',

	'异常捕获 _(:з」∠)_'		=> '异常捕獲_（：з」∠）_',
	'页面地址：'				=> '頁面地址：',
	'异常类型：'				=> '异常類型：',
	'异常代码：'				=> '异常代碼：',
	'异常定位：'				=> '异常定位：',
	'的'						=> '的',
	'行'						=> '行',
	'异常信息：'				=> '异常資訊：',
	'数据输出 (〜￣△￣)〜'		=> '數據輸出 (〜￣△￣)〜',
	'来源追踪 ╮(╯﹏╰）╭'			=> '來源追跡 ╮(╯﹏╰）╭',
	'[全部打开]'				=> '[全部打開]',
	'[全部关闭]'				=> '[全部關閉]',
	'管理员信息'				=> '管理員信息',
	'请将错误信息发送给管理员'	=> '請將錯誤資訊發送給管理員',
	
	'提示'						=> '提示',
	'%s 秒后返回上一页面...'	=> '%s 秒後返回上一頁面…',
	'跳转'						=> '跳轉',
	'返回上一页'				=> '返回上一頁',
	
	'%s 秒后将为您自动跳转...'	=> '%s 秒後將為您自動跳轉…',
	'[现在跳转]'				=> '[現在跳轉]',
	'[雅蠛蝶！等等]'			=> '[雅蠛蝶！等等]',

	'adminphp'	=> [
		'sysinfo'	=> [
			'antiCSRF'	=> [
				'code'	=> '403',
				'type'	=> 'error',
				'info'	=> '表單驗證未通過!',
				'more'	=> [
					'您同時打開了多個頁面',
					'您直接通過網址訪問表單提交頁面',
					'請嘗試關掉其他頁面',
					'或者返回首頁再試壹次'
				]
			],
			'statusCode'	=> [
				'404'		=> [
					'code'		=> '404',
					'type'		=> 'error', //[info, error, success]
					'title'		=> '啊哈... 出了壹點點小問題_(:з」∠)_',
					'info'		=> '頁面找不到啦...',
					'moreTitle'	=> '可能的原因：',
					'more'		=> [
						'手滑輸錯了地址',
						'該頁面已移動到其他地址',
						'妳在用臉滾鍵盤',
						'妳的貓在鍵盤漫步'
					]
				],
				'403'		=> [
					'code'		=> '403',
					'type'		=> 'error', //[info, error, success]
					'title'		=> '拒絕訪問 (╯‵□′)╯︵┻━┻',
					'info'		=> '該頁面拒絕訪問',
					'moreTitle'	=> '可能的原因：',
					'more'		=> [
						'妳在嘗試幹點不好的事情',
						'程序員手滑寫錯了什麽東西...',
						'妳在用臉滾鍵盤',
						'妳的貓在鍵盤漫步'
					]
				],
				'500'		=> [
					'code'		=> '500',
					'type'		=> 'error', //[info, error, success]
					'title'		=> '系統故障',
					'info'		=> '系統故障',
					'moreTitle'	=> '啊哈... 出了壹點點小問題_(:з」∠)_',
					'more'		=> [
						'程序猿/媛寫錯了什麽東西。',
						'發生了壹些不可預料的事情。',
						'如果妳發現了有什麽不對，請迅速聯系站點管理員',
						'如果沒什麽不對的，那就再試壹次看看？'
					]
				]
			]
		],
		'errorManager'	=> [
			'adminInfo'	=> [
				'adminphp框架'		=> '<a href="https://www.adminphp.net/" target="_blank">https://www.adminphp.net/</a>',
				'adminphp框架作者'	=> 'Xlch88 (i@xlch.me)',
			]
		]
	]
];